from aiogram import html
from enum import Enum


#############
# Main Menu #
#############


class MenuButtons(Enum):
    information: str = "ℹ️ Інформація"
    locations: str = "📍 Локації"
    contacts: str = "📞 Контакти"
    help_: str = "🆘 Допомога"


###############
# Information #
###############

info_text = "🏠 Ми центр порятунку для різних видів тварин: диких, свійських, різних птахів, екзотичних, домашніх.\n\n🗓 Існуємо вже понад 5 років.\n\n🏥 Усіх диких тварин та птахів, які до нас потрапляють з різними проблемами/хворобами, ми лікуємо та в подальшому тих, які можуть повноцінно проживати у природі ми обов’язково випускаємо, а ось ті, яких не можна повернути, залишаються на постійне проживання у притулку.\n\n👩‍⚕️ Домашніх тварин ми лікуємо, реабілітуємо та в подальшому адаптуємо в нові родини."

adoption_text = f"Якщо ви вирішили взяти тварину у свою родину, то у нашому притулку є певні правила прилаштування. \n\nДля початку, вам потрібно пройти співбесіду з нашими працівниками та укласти договір.\n\nМи віддаємо тварину лише за умов належного догляду - регулярне відвідування ветеринара, стерилізація чи кастрація, вакцинація та обробка від паразитів.\n\n{html.link('Детальніше', 'https://www.instagram.com/shelter_domivka_adopt/')}"

found_text = "Перший крок: задля власної безпеки не торкатись тварини незахищеними руками.\n\nДругий: зв’язатись з нами та описати ситуацію. (073-00-00-075)\n\nТретій : діяти далі згідно інструкцій наданих фахівцем."
############
# Location #
############

location_main_text = f"{html.bold('Основна локація з вільним доступом відвідувачів.')}\n\n🕙 Щодня з 10.00 до 19.00\nграфік змінюється в залежно від сезону.\n\n📌 вул. Довбуша 24"
location_main_pic = "https://i.imgur.com/cRBidXs.png"

location_second_text = f"{html.bold('Ще в процесі будівництва')}, але вже проживає понад 250 тварин.\n\n📌 Червоноградський р-н, с. Тичок"


###########
# Contact #
###########

contact_text = f"📞 {html.bold('Номер телефону:')}\n+380730000075\n\n{html.bold('Інші соцмережі:')}"
