from aiogram import html
from enum import Enum


#############
# Main Menu #
#############


class MenuButtons(Enum):
    information: str = "ℹ️ Інформація"
    locations: str = "📍 Локації"
    contacts: str = "📞 Контакти"
    help_: str = "🆘 Допомога"


###############
# Information #
###############

info_text = (
    "Ми - “Домівка врятованих тварин” - спеціалізований центр з порятунку тварин, який виконує свою місію більше 5-ти років.\n\n"
    + "Ми рятуємо усіх тварин, які зазнають насилля, жорстокого поводження та потребують прихистку: диких, свійських, домашніх та навіть екзотичних. І не лише рятуємо, а й лікуємо, реабілітуємо, адаптовуємо та прилаштовуємо.\n\n"
    + "Тільки за останні два роки війни через наш центр пройшло понад 8 000 тварин, більшу частину з яких ми повернули у звичне для них природне середовище, а частині тварин ми знайшли нові домівки.\n\n"
    + "Всі ж інші, а це понад 1 500 тварин, й надалі знаходяться під нашою опікою та проживають у  “Домівці”."
)

adoption_text = (
    "Якщо ти вирішив знайти вірного пухнастого друга, то запрошуємо тебе на зустріч із мешканцями  “Домівки врятованих тварин”. У нас живе багато цікавих та красивих тваринок, які шукають люблячу родину. І саме тут, у “Домівці”, ти зможеш знайти СВОГО, милого серцю, песика чи котика. Якщо ти порозумієшся із хвостатим обранцем та симпатії будуть взаємними (еге ж, тварини також обирають собі господаря), то він стане членом твоєї родини. Це ми засвідчуємо документально, підписуючи спеціальну угоду (потрібно мати із собою паспорт)."
    + f"\n\n{html.link('Детальніше', 'https://www.instagram.com/shelter_domivka_adopt/')}"
)

found_text = "Перший крок: задля власної безпеки не торкатись тварини незахищеними руками.\n\nДругий: зателефонуй нам та опиши ситуацію (+380730000075)\n\nТретій: дій згідно інструкцій, наданих фахівцем."
############
# Location #
############

location_main_text = f"{html.bold('Основна локація з вільним доступом відвідувачів.')}\n\n🕙 Щодня з 10.00 до 19.00\nграфік змінюється в залежно від сезону.\n\n📌 вул. Довбуша 24"
location_main_pic = "https://i.imgur.com/cRBidXs.png"

location_second_text = f"{html.bold('Ще в процесі будівництва')}, але вже проживає понад 250 тварин.\n\n📌 Червоноградський р-н, с. Тичок"


###########
# Contact #
###########

contact_text = f"📞 {html.bold('Номер телефону:')}\n+380730000075\n\n{html.bold('Інші соцмережі:')}"

########
# Help #
########

help_text = f"{html.bold('Яка допомога нам потрібна?')}\n\nНатискайте одну або й всі три кнопки з поясненням кожної:"

help_finance = (
    "Розрахунковий рахунок:\n"
    + "БО БФ «Домівка Врятованих Тварин»\n"
    + "ЄДРПОУ:44086841\n"
    + "IBAN: UA773052990000026006031017177\n"
    + "АТ КБ «ПРИВАТБАНК»\n"
    + "5169 3305 2375 2514\n"
    + "PayPal domivka_@ukr.net\n"
    + "посилання на банку https://send.monobank.ua/jar/68QWKvPq3D"
)

help_material = (
    "- лежаки, іграшки;\n"
    "- ліки для обробки від гельмінтів та бліх (для собак та котів): Адвокат, Сімпаріка, Бравекто, Адвантейдж;\n"
    "- курятина (шийки, сердечка,гомілки, крила, спинки);\n"
    "- корм сухий для котів та собак “Клуб 4 Лапи”;\n"
    "- овочі: морква, буряк, капуста, гарбузи, кабачки, огірки;\n"
    "- фрукти: банани, яблука, ківі, хурма, виноград;\n"
    "- риба дрібна (може бути заморожена);\n"
    "- зерно: кукурудза, овес, пшениця, просо, жито, насіння соняшника, гречка, рис, пшоно;\n"
    "- горіхи: грецькі, арахіс, фундук;\n"
    "- сухофрукти: курага, фініки;\n"
    "- смаколики для собак та котів.\n"
)

help_physical = (
    "вигул собак, допомога з прибиранням у вольєрах та на території притулку."
)
